# Практическое задание №06-1  (Overone)
# Создайте словарь person, в котором будут
# присутствовать ключи name, age, city.
# Выведите значение возраста из словаря person
person ={'name':"Yana", 'age': 24, 'city':'Minsk'}
print(person['age'])